/******************************************************************************
Portal Quest by BurAndBY

*******************************************************************************/
#include <iostream>
using namespace std;

int main()
{
   double AI_Var;
   cout << "Вы просыпаетесь в камере, рядом стоит унитаз, стол, радио настроеное на непонятную частоту, и какя-то непонятная штука.Через 5 секунд в ней появляется синий овал. Что вы будете делать?" <<endl;
   cout << "1 - Пройти в синий овал"<< endl;
   cout << "0 - Прислушаться"<< endl;
   cin  >> AI_Var;
   if (AI_Var == 0)
   {
       cout << "Вы услышали: 'Добро пожаловать в компьютеризированный экспериментальный центр при лаборатории исследования природы порталов. Приготовьтесь к открытию портала. Три... два... один... Бддз...'";
      
   }
   cout << "Вы проходите в синий овал и появляетесь за пределами камеры. Вы видите дверь. Что вы будете делать?" <<endl;
   cout << "1 - Пройду через дверь"<< endl;
   cout << "0 - Прислушаться"<< endl;
   cin  >> AI_Var;
   if (AI_Var == 0)
   {
       cout << "Из соображений вашей безопасности и безопасности окружающих воздержитесь дотрагиваться до 'бзз' чего бы то ни было вообще.Por favor bordón de fallar Muchos gracias de fallar gracias"<<endl;
   }
  cout << "Это экспериментальное поле анти-экспроприации лабораторного оборудования аннигилирует любой оказавшийся в нем предмет, не подлежащий выносу, например, экспериментальный утяжеленный грузовой куб." <<endl;
           cout << "1 - Пройти испытание и пройти открывающаюся дверь"<< endl;
           cout << "0 - Прислушаться"<< endl;
   cin  >> AI_Var;
      if (AI_Var == 0)
   {
       cout << "Поместите экспериментальный утяжеленный грузовой куб на 1500-мегаваттную экспериментальную сверхпрочную сверхударную сверхкнопку." <<endl;
   }
  cout << "Поместите экспериментальный утяжеленный грузовой куб на 1500-мегаваттную экспериментальную сверхпрочную сверхударную сверхкнопку." <<endl;          
                cout << "1 - Поместить экспериментальный утяжеленный грузовой куб на 1500-мегаваттную экспериментальную сверхпрочную сверхударную сверхкнопку. "<< endl;
                cout << "0 - Стоять дальше"<< endl;
   cin  >> AI_Var;
   if (AI_Var == 0)
   {
       cout << "Пройдите камеру испытаний, ибо вас убьет смертельный газ нейротоксин." <<endl;
   }
  cout << "Идеально. Немедленно покиньте исследовательскую камеру, поскольку продолжительное воздействие излучения Кнопки на организм не является частью данного испытания." <<endl;
           cout << "1 - Покинуть камеру"<< endl;
                cout << "0 - No"<< endl;
   cin  >> AI_Var;
   if (AI_Var == 1)
   cout << "Благодорю за продолжительное прохождение квеста 'Portal Quest' от BurAndBY";
   return 0;
}
   
  



